; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	spectrograph1 - mode
	spectrograph0 - mode
	GroundStation1 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	GroundStation5 - direction
	GroundStation2 - direction
	Star4 - direction
	Star6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 Star4)
	(supports instrument1 spectrograph1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon11)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
	(supports instrument3 spectrograph0)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star4)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation2)
)
(:goal (and
	(pointing satellite2 Phenomenon14)
	(have_image Star6 spectrograph1)
	(have_image Star7 spectrograph1)
	(have_image Phenomenon8 spectrograph0)
	(have_image Planet9 spectrograph0)
	(have_image Planet10 spectrograph0)
	(have_image Phenomenon11 spectrograph0)
	(have_image Planet12 spectrograph1)
	(have_image Phenomenon13 spectrograph1)
	(have_image Phenomenon14 spectrograph1)
	(have_image Planet15 spectrograph0)
	(have_image Star16 spectrograph1)
))

)

; plan
1. (turn_to satellite2 star4 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 star4)
   goals met: 0 of 12
2. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 12
3. (calibrate satellite2 instrument3 star4)
   added: (calibrated instrument3)
   goals met: 0 of 12
4. (turn_to satellite2 planet10 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 planet10)
   goals met: 0 of 12
5. (take_image satellite2 planet10 instrument3 spectrograph0)
   added: (have_image planet10 spectrograph0)
   goals met: 1 of 12
6. (turn_to satellite2 phenomenon8 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 phenomenon8)
   goals met: 1 of 12
7. (take_image satellite2 phenomenon8 instrument3 spectrograph0)
   added: (have_image phenomenon8 spectrograph0)
   goals met: 2 of 12
8. (turn_to satellite2 phenomenon13 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 phenomenon13)
   goals met: 2 of 12
9. (take_image satellite2 phenomenon13 instrument3 spectrograph1)
   added: (have_image phenomenon13 spectrograph1)
   goals met: 3 of 12
10. (turn_to satellite2 phenomenon11 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 phenomenon11)
   goals met: 3 of 12
11. (take_image satellite2 phenomenon11 instrument3 spectrograph0)
   added: (have_image phenomenon11 spectrograph0)
   goals met: 4 of 12
12. (turn_to satellite2 planet12 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 planet12)
   goals met: 4 of 12
13. (take_image satellite2 planet12 instrument3 spectrograph1)
   added: (have_image planet12 spectrograph1)
   goals met: 5 of 12
14. (turn_to satellite2 planet15 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 planet15)
   goals met: 5 of 12
15. (take_image satellite2 planet15 instrument3 spectrograph0)
   added: (have_image planet15 spectrograph0)
   goals met: 6 of 12
16. (turn_to satellite2 planet9 planet15)
   deleted: (pointing satellite2 planet15)
   added: (pointing satellite2 planet9)
   goals met: 6 of 12
17. (take_image satellite2 planet9 instrument3 spectrograph0)
   added: (have_image planet9 spectrograph0)
   goals met: 7 of 12
18. (turn_to satellite2 star16 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 star16)
   goals met: 7 of 12
19. (take_image satellite2 star16 instrument3 spectrograph1)
   added: (have_image star16 spectrograph1)
   goals met: 8 of 12
20. (turn_to satellite2 star6 star16)
   deleted: (pointing satellite2 star16)
   added: (pointing satellite2 star6)
   goals met: 8 of 12
21. (take_image satellite2 star6 instrument3 spectrograph1)
   added: (have_image star6 spectrograph1)
   goals met: 9 of 12
22. (turn_to satellite2 star7 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 star7)
   goals met: 9 of 12
23. (take_image satellite2 star7 instrument3 spectrograph1)
   added: (have_image star7 spectrograph1)
   goals met: 10 of 12
24. (turn_to satellite2 phenomenon14 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 phenomenon14)
   goals met: 11 of 12
25. (take_image satellite2 phenomenon14 instrument3 spectrograph1)
   added: (have_image phenomenon14 spectrograph1)
   goals met: 12 of 12
